<template>
  <div>
    <div class="definitions-service">
      <dl>
        <dt>2. Основыные определения:</dt>
        <dd>
          «Аренда корта» — подразумевает проход не более 4-х человек на один
          теннисный корт. Проход большего количества человек осуществляется по
          согласованию с администрацией Клуба, при условии дополнительной оплаты
          согласно утвержденному прайсу.
        </dd>
        <dd>
          «Разовое посещение» — считается единовременное занятие
          продолжительностью не менее часа игры на теннисном корте.
        </dd>
        <dd>
          «Занятие с тренером на месяц» — считается суммарное количество занятий
          (не менее 4 часов) на теннисном корте с постоянными днями недели и
          временем начала и окончания занятия на протяжении одного календарного
          месяца. Продолжительность одного занятия в течение недели составляет
          не менее часа.
        </dd>
        <dd>
          «Игровое время» — фактическое время на теннисном корте,
          предоставляемое Клиенту по предварительной Заявке и кратное 30
          минутам.
        </dd>
        <dd>
          «Гость» — приглашенный Клиентом на территорию ТК человек. На всех
          гостей распространяется действие настоящих Правил.
        </dd>
      </dl>
    </div>
  </div>
</template>

<script lang="ts">
import { Component, Vue } from "vue-property-decorator";

@Component
export default class GeneralDefinitionsComponent extends Vue {}
</script>

<style scoped lang="scss">
.definitions-service {
  padding-left: 100px;
  width: 900px;
}
dd {
  margin-top: 20px;
  margin-left: 10px;
}
</style>
