<template>
  <div>
    <div class="time-corts-club">
      <dl>
        <dt>3.1. ТК предоставляет Членам клуба:</dt>
        <dd>
          <div class="line-for-list"></div>
          Разовое посещение;
        </dd>
        <dd>
          <div class="line-for-list"></div>
          Абономоент с фиксированным временем;
        </dd>
        <dd>
          <div class="line-for-list"></div>
          Абономенты на 30 и 50 часов;
        </dd>
        <dd>
          <div class="line-for-list"></div>
          Индивидуальные занятия с тренером;
        </dd>
        <dd>
          <div class="line-for-list"></div>
          "Клуб любителей тенниса";
        </dd>
      </dl>
      <dl>
        <dt class="dt-for-min-time">3.2. Минимальное время:</dt>
        <dd>
          <div class="line-for-list"></div>
          Разовое посещение;
        </dd>
        <dd>
          <div class="line-for-list"></div>
          Абономоент с фиксированным временем;
        </dd>
        <dd>
          <div class="line-for-list"></div>
          Абономенты на 30 и 50 часов;
        </dd>
        <dd>
          <div class="line-for-list"></div>
          Индивидуальные занятия с тренером;
        </dd>
        <dd>
          <div class="line-for-list"></div>
          "Клуб любителей тенниса";
        </dd>
      </dl>
      <dl>
        <dt class="dt-for-game-time">
          3.3. Игровое время на основании заявок (брони)
        </dt>
        <p>
          ТК предоставляет игровое время на основании заявок (брони) Членов
          клуба с учетом расписания работы корта, проведения соревнований,
          клубных мероприятий, производства ремонтно-профилактических работ.
          Бронирование игрового времени осуществляется через администратора ТК.
          Бронирование может производиться непосредственно в Комплексе, либо по
          телефону. 3.4 ТК не несет ответственности за сохранение расписания
          игрового времени за Членом клуба после окончания срока действия
          абонемента, а также в случае нарушения срока оплаты услуг. 3.5
          Абонемент имеют право приобретать только Члены ТК. Приобретение
          абонементов тренерами запрещено. 3.6. Отмена игрового времени может
          производится не позднее 24 часов до начала занятия и отыгрываться в
          течение сезона на равноценном времени, либо, при желании, на более
          дорогом, с доплатой. Не отмененное вовремя занятие считается
          состоявшимся и оплачивается по текущему тарифу. 3.7. При проведении
          соревнований, Клубных мероприятиях, технических неисправностях, не
          позволяющих эксплуатацию кортов, ТК имеет право производить изменения
          в расписании. При этом ТК обязуется заблаговременно уведомить Члена
          клуба по телефону об изменении в расписании, а также предоставить
          возможность равнозначно компенсировать пропущенное игровое время в
          удобное для Члена клуба время с учетом занятости кортов. 3.8.
          Компенсация (обоюдно согласованное равноценное игровое время) для
          занятий в ТК предоставляется также в случаях:
        </p>
        <dd>
          <div class="line-for-list"></div>
          Индивидуальные занятия с тренером;
        </dd>
        <dd>
          <div class="line-for-list"></div>
          "Клуб любителей тенниса";
        </dd>
      </dl>
    </div>
  </div>
</template>

<script lang="ts">
import { Component, Vue } from "vue-property-decorator";

@Component
export default class ScheduleComponent extends Vue {}
</script>

<style scoped lang="scss">
dd {
  margin-left: 10px;
  margin-top: 10px;
  display: flex;
}
p {
  margin-left: 10px;
  margin-top: 10px;
}
.line-for-list {
  width: 13px;
  height: 2px;
  background-color: #8d86c9;
  margin-top: 7px;
  margin-right: 10px;
}
.time-corts-club {
  padding-left: 150px;
  width: 900px;
}
.dt-for-min-time {
  margin-top: 50px;
}
.dt-for-game-time {
  margin-top: 50px;
}
</style>
